// 1.Створіть функцію, яка приймає рядок і колбек - функцію для обробки цього рядка.
// Потім викличте колбек - функцію, передаючи їй цей рядок.

// const reversStr = function (string) {
//   const newStr = string.split('').reverse().join('');
//   console.log(newStr);
// };

// const foo = function (str, callback) {
//   callback(str);
// };

// foo('Hello', reversStr);
// =============================================================================
// 2.Напишіть функцію, яка приймає масив чисел і колбек - функцію, яка обчислює суму цих чисел.
// Потім викличте колбек - функцію, передаючи їй суму.

// const arrOfNumbers = [1, 2, 3];

// const calculateSum = function (numbers, callback) {
//   let sum = 0;
//   for (const number of numbers) {
//     sum += number;
//   }
//   callback(sum);
// };

// calculateSum(arrOfNumbers, sum => console.log(sum));
// ======================================================================================
// 3.Створіть функцію, яка приймає два числа і колбек - функцію для обчислення їх добутку.
// Потім викличте колбек - функцію, передаючи їй добуток цих чисел.

// const calculateSum = (firstNumber, secondNUmber, callback) => {
//   const result = firstNumber + secondNUmber;

//   callback(result);
// };

// calculateSum(2, 3, value => console.log(value));
// ========================================================================================
// 4.Напишіть функцію, яка приймає масив слів і колбек - функцію для обробки цих слів.
// Потім викличте колбек - функцію, передаючи їй перший елемент масиву.

// 5.Створіть функцію, яка приймає об'єкт з ім'ям та віком і колбек - функцію для обробки
// цього об'єкта. Потім викличте колбек-функцію, передаючи їй об'єкт.
